experimental-init.org
#+TITLE: Experimental init.el
#+PROPERTY: tangle "~/.emacs.d/experminal-init.el"
#+STARTUP: content

* 参考
- [[https://ayatakesi.github.io/emacs/29.4/html/index.html][Emacs Japanese]]
- https://takaxp.github.io/org-ja.html
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/][An Introduction to Programing in Emacs Lisp]]
- [[https://www.google.com/]]
- file:///usr/local/share/GNUstep/Documentation/Developer/Base/ProgrammingManual/gs-base/index.html
- file:///usr/local/share/GNUstep/Documentation/Developer/Base/Reference/Base.html

* このファイルの使用方法
#+BEGIN_SRC shell :tangle no
  alias emacs2='emacs -Q -l ~/.emacs.d/experminal-init.el'
  # then use: emacs2 <Enter>
#+END_SRC

* ファイルの生成方法
#+BEGIN_SRC :tangle no
C-c C-v C-t
#+END_SRC

* Script Runner

これはブラウザの拡張機能であり、以下のソースを GNU Manuals というタイトルのもとに貼り付けて利用すれば、おかしな翻訳を避けることができる。
** TODO あれ、javascript で C-M-\ =indent-region= すると、4space のインデントになってしまう。どこかで見直そう。

#+begin_src javascript
  const classes = [
      "example",
      "category-def",
      "def-name",
      "def-var-arguments"
  ]

  const qclasses = classes.map((v) => "." + v).join(",")

  document.querySelectorAll(qclasses).forEach((el) => {
      if (!el.hasAttribute("translate")) {
          el.setAttribute("translate", "no");
      }
  });
#+end_src

* スタートアップメッセージ
#+BEGIN_SRC elisp :tangle yes
  ;;; Code:

  (with-current-buffer "*scratch*"
    (insert ";;; loading Experimental init.el\n")
    (insert ";;; Emacs " emacs-version "\n")
    (insert "\n")
    (insert "\n"))

  (when (file-directory-p "~/.emacs.d/lisp")
    (push (expand-file-name "~/.emacs.d/lisp") load-path))

  (setq gc-cons-threshold 100000000)
  (setq read-process-output-max (* 80 1024 1024)) ;; 8mb
  ;; カスタムコマンドのロード
  (require 'kf-command)
  (require 'mpascal)

  (add-to-list 'auto-mode-alist
               '("\\.\\(p\\|pas\\|dpr\\|dpk\\)\\'" . mpascal-mode))
#+END_SRC
* 基本設定
#+begin_src elisp :tangle yes
  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room

  (menu-bar-mode -1)            ; Disable the menu bar

  ;; Set up the visible bell
  (setq visible-bell t)

  (column-number-mode)
  (global-display-line-numbers-mode -1)
#+end_src
* パッケージ自動アップデート
#+BEGIN_SRC elisp :tangle yes
  ;; パッケージアーカイブ
  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")
  (eval-and-compile
    (require 'package)
    (customize-set-variable
     'package-archives '(("org" . "https://orgmode.org/elpa/")
			 ("melpa" . "https://melpa.org/packages/")
			 ("melpa-stable" . "https://mstable.elpa.org/packages/")
			 ("gnu" . "https://elpa.gnu.org/packages/")))
    (package-initialize)
    (unless package-archive-contents
      (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms
    (unless (package-installed-p 'use-package)
      (package-install 'use-package))

    (require 'use-package)
    (setq use-package-always-ensure t))

  ;; パッケージ自動アップデート
  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "20:00"))
#+END_SRC

* EditorConfig
#+begin_src elisp :tangle yes
  ;; Editor Config
  ;; https://editorconfig.org/
  (use-package editorconfig
    :ensure t
    :config
    (editorconfig-mode 1))
#+end_src

;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Reload?")(load-file user-init-file))) nil t)
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t)
;; End:
* より本物に近いターミナルエミュレータ
https://github.com/akermu/emacs-libvterm
** 前提条件
Cライブラリをコンパイルして利用するため、コンパイル環境を準備
*** Debian 系列
#+begin_src sh
  sudo apt install libtool
  sudo apt install libtool-bin
#+end_src
*** Haiku
#+begin_src sh
  pkgman install cmake
  pkgman install libtool
#+end_src
** パッケージ導入
#+begin_src elisp :tangle yes
  ;; より本物に近いターミナルエミュレータ
  (use-package vterm
    :unless (eq system-type 'windows-nt)
    :ensure t)
#+end_src
* 基本関数
#+BEGIN_SRC elisp :tangle yes
  ;; 基本関数
  (defun replace-in-string (what with in)
    (replace-regexp-in-string (regexp-quote what) with in nil 'literal))

  (defun safe-system-type-string ()
    (replace-in-string "/" "_" (prin1-to-string system-type)))

  (defun safe-host-name-string ()
    (replace-in-string "/" "_" (downcase (system-name))))

  (defun sys-base-name (prefix suffix)
    (concat prefix "-" (safe-system-type-string) suffix ))

  (defun host-base-name (prefix suffix)
    (concat prefix "-" (safe-host-name-string) suffix ))
#+END_SRC

* 外部プロセス更新ファイルのバッファ同期
#+BEGIN_SRC elisp :tangle yes
  ;; 外部プロセス更新ファイルのバッファ同期
  (setq make-backup-files nil)
  ;; https://takaxp.github.io/init.html#orgc2257142
  (when (require 'auto-save-buffers nil t)

    (defun my-ox-hugo-auto-saving-p ()
      (when (eq major-mode 'org-mode)
        (or (bound-and-true-p org-capture-mode) ;; when activating org-capture
            (and (fboundp 'org-entry-get)
                 (equal "" (org-entry-get (point) "EXPORT_FILE_NAME"))))))

    (defun my-auto-save-buffers ()
      (cond ((memq major-mode '(undo-tree-visualizer-mode diff-mode)) nil)
            ((string-match "Org Src" (buffer-name)) nil)
            ((let ((pt (point)))
               (and (string-match ".gpg" (buffer-name))
                    (not (eq pt 1))
                    (string-match (buffer-substring (- pt 1) pt) " "))) nil) ;; .gpg で半角スペースの後ろのブリッツでは自動保存しない．FIXME 半角スペース+行末
            ((my-ox-hugo-auto-saving-p) nil)
            (t
             (auto-save-buffers))))

    (run-with-idle-timer 1.6 t #'my-auto-save-buffers))

  (unless noninteractive
    (global-auto-revert-mode 1)
    ;; revert されるのが org バッファのとき，自動的にドロワをたたむ
    ;; カーソルが (point-max) に移動してしまう場合は非推奨
    (with-eval-after-load "org"
      (defun my-org-hide-drawers-all ()
        (when (eq major-mode 'org-mode)
          (org-cycle-hide-drawers 'all)))
      (add-hook 'after-revert-hook 'my-org-hide-drawers-all)))
#+END_SRC

* 最近訪れたファイル対応
#+BEGIN_SRC elisp :tangle yes
  ;; 最近訪れたファイル対応
  (defun recentf-base-name ()
    (host-base-name "recentf" ".dat"))

  (defun recentf-file-name ()
    (expand-file-name (locate-user-emacs-file (recentf-base-name))))

  (setq recentf-save-file (recentf-file-name))

  (recentf-mode 1)
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 25)
  (global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+END_SRC
* ido
* オプション
現在の起動オプションでは読み込ませたくないので、一時的に除外する。
これは、emacs の起動引数の役割を私が理解していないためである。

#+begin_src elisp :tangle yes
  (defun options-base-name ()
    (sys-base-name "options-experimental" ".el"))

  (defun options-file-name ()
    (expand-file-name (locate-user-emacs-file (options-base-name))))

  (setq custom-file (options-file-name))
  (if (file-exists-p custom-file)
      (load custom-file t nil nil))
#+end_src

*** DONE 他のホストと、衝突する恐れがある
単純に導入しただけでは、Nextcloudで共有している他のホストと衝突してしまう。
本来であれば、Nextcloudクライアント側でignore ファイルを共有して回避すべき問題である。
ホスト名を付加して衝突回避できるか要検討。
* 拡張選択範囲
#+BEGIN_SRC elisp :tangle yes
  ;; 拡張選択範囲
  (use-package expand-region
    :ensure t)
  (global-set-key (kbd "C-q") 'er/expand-region)
#+END_SRC

* コード補完
#+BEGIN_SRC elisp :tangle yes
  ;; コード補完
  (use-package company
    :ensure t)
#+END_SRC

* ミニバッファーの改善
詳しい解説は次のビデオにある https://www.youtube.com/watch?v=d3aaxOqwHhI
** vertico, marginalia
#+begin_src elisp :tangle yes
  ;; ミニバッファーの改善
  ;; https://github.com/minad/vertico
  (use-package vertico
    :ensure t
    :config
    (setq vertico-cycle t)
    (setq vertico-resize nil)
    (vertico-mode 1))

  ;; https://github.com/minad/marginalia
  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode 1))

  ;; https://github.com/minad/consult
  (use-package consult
    :ensure t)
#+end_src

