experimental-init.el
;;; Code:

(with-current-buffer "*scratch*"
  (insert ";;; loading Experimental init.el\n")
  (insert ";;; Emacs " emacs-version "\n")
  (insert "\n")
  (insert "\n"))

(when (file-directory-p "~/.emacs.d/lisp")
  (push (expand-file-name "~/.emacs.d/lisp") load-path))

(setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 80 1024 1024)) ;; 8mb
;; カスタムコマンドのロード
(require 'kf-command)
(require 'mpascal)

(add-to-list 'auto-mode-alist
             '("\\.\\(p\\|pas\\|dpr\\|dpk\\)\\'" . mpascal-mode))

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)            ; Disable the menu bar

;; Set up the visible bell
(setq visible-bell t)

(column-number-mode)
(global-display-line-numbers-mode -1)

;; パッケージアーカイブ
(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")
(eval-and-compile
  (require 'package)
  (customize-set-variable
   'package-archives '(("org" . "https://orgmode.org/elpa/")
		       ("melpa" . "https://melpa.org/packages/")
		       ("melpa-stable" . "https://mstable.elpa.org/packages/")
		       ("gnu" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t))

;; パッケージ自動アップデート
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "20:00"))

;; Editor Config
;; https://editorconfig.org/
(use-package editorconfig
  :ensure t
  :config
  (editorconfig-mode 1))

;; より本物に近いターミナルエミュレータ
(use-package vterm
  :unless (eq system-type 'windows-nt)
  :ensure t)

;; 基本関数
(defun replace-in-string (what with in)
  (replace-regexp-in-string (regexp-quote what) with in nil 'literal))

(defun safe-system-type-string ()
  (replace-in-string "/" "_" (prin1-to-string system-type)))

(defun safe-host-name-string ()
  (replace-in-string "/" "_" (downcase (system-name))))

(defun sys-base-name (prefix suffix)
  (concat prefix "-" (safe-system-type-string) suffix ))

(defun host-base-name (prefix suffix)
  (concat prefix "-" (safe-host-name-string) suffix ))

;; 外部プロセス更新ファイルのバッファ同期
(setq make-backup-files nil)
;; https://takaxp.github.io/init.html#orgc2257142
(when (require 'auto-save-buffers nil t)

  (defun my-ox-hugo-auto-saving-p ()
    (when (eq major-mode 'org-mode)
      (or (bound-and-true-p org-capture-mode) ;; when activating org-capture
          (and (fboundp 'org-entry-get)
               (equal "" (org-entry-get (point) "EXPORT_FILE_NAME"))))))

  (defun my-auto-save-buffers ()
    (cond ((memq major-mode '(undo-tree-visualizer-mode diff-mode)) nil)
          ((string-match "Org Src" (buffer-name)) nil)
          ((let ((pt (point)))
             (and (string-match ".gpg" (buffer-name))
                  (not (eq pt 1))
                  (string-match (buffer-substring (- pt 1) pt) " "))) nil) ;; .gpg で半角スペースの後ろのブリッツでは自動保存しない．FIXME 半角スペース+行末
          ((my-ox-hugo-auto-saving-p) nil)
          (t
           (auto-save-buffers))))

  (run-with-idle-timer 1.6 t #'my-auto-save-buffers))

(unless noninteractive
  (global-auto-revert-mode 1)
  ;; revert されるのが org バッファのとき，自動的にドロワをたたむ
  ;; カーソルが (point-max) に移動してしまう場合は非推奨
  (with-eval-after-load "org"
    (defun my-org-hide-drawers-all ()
      (when (eq major-mode 'org-mode)
        (org-cycle-hide-drawers 'all)))
    (add-hook 'after-revert-hook 'my-org-hide-drawers-all)))

;; 最近訪れたファイル対応
(defun recentf-base-name ()
  (host-base-name "recentf" ".dat"))

(defun recentf-file-name ()
  (expand-file-name (locate-user-emacs-file (recentf-base-name))))

(setq recentf-save-file (recentf-file-name))

(recentf-mode 1)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 25)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)

(defun options-base-name ()
  (sys-base-name "options-experimental" ".el"))

(defun options-file-name ()
  (expand-file-name (locate-user-emacs-file (options-base-name))))

(setq custom-file (options-file-name))
(if (file-exists-p custom-file)
    (load custom-file t nil nil))

;; 拡張選択範囲
(use-package expand-region
  :ensure t)
(global-set-key (kbd "C-q") 'er/expand-region)

;; コード補完
(use-package company
  :ensure t)

;; ミニバッファーの改善
;; https://github.com/minad/vertico
(use-package vertico
  :ensure t
  :config
  (setq vertico-cycle t)
  (setq vertico-resize nil)
  (vertico-mode 1))

;; https://github.com/minad/marginalia
(use-package marginalia
  :ensure t
  :config
  (marginalia-mode 1))

;; https://github.com/minad/consult
(use-package consult
  :ensure t)
