experimental-init.org
* Corf
#+begin_src elisp :tangle yes
  ;; https://github.com/minad/corfu
  (use-package corfu
    ;; Optional customizations
    ;; :custom
    ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    ;; (corfu-auto t)                 ;; Enable auto completion
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches

    ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
    ;; be used globally (M-/).  See also the customization variable
    ;; `global-corfu-modes' to exclude certain modes.
    :init
    (global-corfu-mode))

  ;; A few more useful configurations...
  (use-package emacs
    :custom
    ;; TAB cycle if there are only few candidates
    ;; (completion-cycle-threshold 3)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function.
    ;; Try `cape-dict' as an alternative.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p))
#+end_src
* ディレクトリ表示の簡素化
https://emacs.stackexchange.com/questions/27912/dired-sort-and-hide-by-default
#+begin_src elisp
  ;; ディレクトリ表示の簡素化
  ;; https://emacs.stackexchange.com/questions/27912/dired-sort-and-hide-by-default
  (add-hook 'dired-mode-hook
            (lambda ()
              (dired-hide-details-mode 1)
              (dired-sort-toggle-or-edit)))
#+end_src
* Magit 設定
#+BEGIN_SRC elisp :tangle yes
  ;; Magit 設定
  (use-package magit
    :ensure t
    :pin melpa)

  ;; https://joppot.info/posts/f3007a42-5ba2-4060-90d4-496697413cf9
  (use-package diff-hl
    :ensure t
    :init
    (global-diff-hl-mode)
    (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
    (unless (window-system) (diff-hl-margin-mode))
    :custom-face
    (diff-hl-change ((t (:background "#8adf80"))))
    (diff-hl-delete ((t (:background "#ff8f88"))))
    (diff-hl-insert ((t (:background "#bfc9ff"))))
    :config
    (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
    (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh))
#+END_SRC

* Lisp ファミリ基本設定
#+BEGIN_SRC elisp :tangle yes
  ;; Lisp ファミリ基本設定
  (show-paren-mode t)
  (use-package paredit
    :ensure t
    :commands enable-paredit-mode
    :hook ((emacs-lisp-mode
            org-mode)
           . enable-paredit-mode))

  (use-package smartparens :ensure t)
  (use-package rainbow-delimiters :ensure t)
#+END_SRC

** emacs lisp
#+BEGIN_SRC elisp :tangle yes
  ;; emacs lisp
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode)
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
  ;; (add-hook 'emacs-lisp-mode-hook 'company-mode)
  ;; (add-hook 'emacs-lisp-mode-hook 'subword-mode)
  ;; (add-hook 'emacs-lisp-mode-hook 'aggressive-indent-mode)

  (eval-after-load 'inferior-emacs-lisp-mode
    '(progn
       (add-hook 'ielm-mode-hook 'paredit-mode)
       (define-key paredit-mode-map (kbd "RET") nil)
       (define-key paredit-mode-map (kbd "C-j") 'paredit-newline)))

#+END_SRC

* DONE 横に広がりすぎて編集しづらい。auto wrapp で単語境界で区切るのは日本語には合わない
=C-x x t=
=toggle-truncate-lines=
でトグルできるのだが、継続行が先頭に来て見づらくなる。
そこで次の記事を参考にしてみた。
https://zenn.dev/ebang/articles/231106_emacs-markdown
#+begin_src elisp :tangle yes
  (use-package markdown-mode
    :mode ("\\.md\\'" . markdown-mode)
    :init
    (add-hook 'markdown-mode-hook #'turn-off-auto-fill)
    (add-hook 'markdown-mode-hook #'turn-on-visual-line-mode))

  (unless (version< emacs-version "29.1")
    (use-package word-wrap-mode
      :hook (visual-line-mode . word-wrap-whitespace-mode)
      :config
      (add-to-list 'word-wrap-whitespace-characters ?\])))

  ;; (use-package visual-fill-column
  ;;   :hook (visual-line-mode . visual-fill-column-mode)
  ;;   :init
  ;;   (setq visual-line-fringe-indicators '(left-curly-arrow nil))
  ;;   :config
  ;;   (setq visual-fill-column-width 120))

  (use-package adaptive-wrap
    :hook (visual-line-mode . adaptive-wrap-prefix-mode))
#+end_src

* Org
** 近代化
#+begin_src elisp :tangle yes
  (use-package org-modern
    :ensure t
    :hook ((org-mode . org-modern-mode)))
#+end_src

** =<s <tab>= でブロック文のテンプレートを挿入
#+BEGIN_SRC elisp :tangle yes
  ;; <s <tab> でブロック文のテンプレートを挿入
  (require 'org-tempo)
#+END_SRC

** デフォルトのbabelではシェルは禁止されているの使えるようにする
#+begin_src elisp :tangle yes
  ;; デフォルトのbabelではシェルは禁止されているの使えるようにする
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (shell . t)
     (ruby . t)
     (python . t)
     ))
#+end_src
** DONE 起動時に、自動で折りたたむ設定はどうだったっけ
参考: https://takaxp.github.io/org-ja.html
#+begin_src
#+STARTUP: content
#+end_src
#+
** =open-url-at-point= で開かれるブラウザの設定
#+begin_src elisp :tangle yes
(setq browse-url-browser-function 'eww-browse-url)
#+end_src

* お遊び
