experimental-init.org
** eww がローカルのファイルを開けるか
#+begin_src elisp
(eww-browse-url "file:///usr/local/share/GNUstep/Documentation/Developer/Base/ProgrammingManual/gs-base/index.html")
#+end_src

** string-matchの実験
#+begin_src elisp
  (string-match-p "\\.wav$"
		  "/usr/share/sounds/sound-icons/canary-long.wav")
  (string-match-p "^file:///"
		  "file:///usr/local/share/GNUstep/Documentation/Developer/Base/ProgrammingManual/gs-base/index.html")
#+end_src

* ポモドーロタイマー
[[https://systemcrafters.net/emacs-shorts/pomodoro-timer/]]
#+begin_src elisp :tangle yes
  ;; https://systemcrafters.net/emacs-shorts/pomodoro-timer/
  (setq org-clock-sound "/usr/share/sounds/sound-icons/xylofon.wav")
  ;; C-c C-x ;
  (org-timer-set-timer 25)
#+end_src

#+RESULTS:
: /usr/share/sounds/sound-icons/xylofon.wav
* キーストローク表示
#+begin_src elisp :tangle yes
  ;; キーストローク表示
  ;; https://github.com/tarsius/keycast
  (use-package keycast
    :ensure t)
#+end_src
* 日本語フォントの設定
** 使用できるフォント名の確認
#+begin_src elisp :results list
  (seq-uniq (sort (font-family-list) 'string<) 'string=)
#+end_src

*** RESULTS(Haiku):
- Bitstream Charter
- Cantarell
- DejaVu Math TeX Gyre
- DejaVu Sans
- DejaVu Sans Mono
- DejaVu Serif
- Fira Mono
- Fira Sans
- Fira Sans Condensed
- FontAwesome
- Material Icons
- Noto Sans
- Noto Sans CJK JP
- Noto Sans Display
- Noto Sans Mono
- Noto Sans Mono CJK JP
- Noto Sans Symbols
- Noto Sans Symbols 2
- Noto Sans Thai
- Noto Serif
- Noto Serif Display
- Noto Serif Thai
- Source Code Pro
- Source Sans Pro
- Source Serif Pro
- Ubuntu
- Ubuntu Condensed
- Ubuntu Mono
- Weather Icons
- all-the-icons
- file-icons
- github-octicons

*** RESULTS(Windows):
- Arial
- Arial Black
- BIZ UDPゴシック
- BIZ UDP明朝 Medium
- BIZ UDゴシック
- BIZ UD明朝 Medium
- Bahnschrift
- Bahnschrift Condensed
- Bahnschrift Light
- Bahnschrift Light Condensed
- Bahnschrift Light SemiCondensed
- Bahnschrift SemiBold
- Bahnschrift SemiBold Condensed
- Bahnschrift SemiBold SemiConden
- Bahnschrift SemiCondensed
- Bahnschrift SemiLight
- Bahnschrift SemiLight Condensed
- Bahnschrift SemiLight SemiConde
- Calibri
- Calibri Light
- Cambria
- Cambria Math
- Candara
- Candara Light
- Cantarell
- Cascadia Code
- Cascadia Code ExtraLight
- Cascadia Code Light
- Cascadia Code SemiBold
- Cascadia Code SemiLight
- Cascadia Mono
- Cascadia Mono ExtraLight
- Cascadia Mono Light
- Cascadia Mono SemiBold
- Cascadia Mono SemiLight
- Comic Sans MS
- Consolas
- Constantia
- Corbel
- Corbel Light
- Courier
- Courier New
- Ebrima
- Fira Code
- Fira Code Light
- Fira Code Medium
- Fira Code Retina
- Fira Code SemiBold
- FixedSys
- FontAwesome
- Franklin Gothic Medium
- Gabriola
- Gadugi
- Georgia
- HackGen
- HackGen Console
- HackGen Console NF
- HackGen Console NFJ
- HackGen35
- HackGen35 Console
- HackGen35 Console NF
- HackGen35 Console NFJ
- HoloLens MDL2 Assets
- Impact
- Ink Free
- Iosevka NF
- Iosevka NF ExtraBold
- Iosevka NF ExtraBold Obl
- Iosevka NF ExtraLight
- Iosevka NF ExtraLight Obl
- Iosevka NF Heavy
- Iosevka NF Heavy Obl
- Iosevka NF Light
- Iosevka NF Light Obl
- Iosevka NF Medium
- Iosevka NF Medium Obl
- Iosevka NF Obl
- Iosevka NF SemiBold
- Iosevka NF SemiBold Obl
- Iosevka NF Thin
- Iosevka NF Thin Obl
- Iosevka NFM
- Iosevka NFM ExtraBold
- Iosevka NFM ExtraBold Obl
- Iosevka NFM ExtraLight
- Iosevka NFM ExtraLight Obl
- Iosevka NFM Heavy
- Iosevka NFM Heavy Obl
- Iosevka NFM Light
- Iosevka NFM Light Obl
- Iosevka NFM Medium
- Iosevka NFM Medium Obl
- Iosevka NFM Obl
- Iosevka NFM SemiBold
- Iosevka NFM SemiBold Obl
- Iosevka NFM Thin
- Iosevka NFM Thin Obl
- Iosevka NFP
- Iosevka NFP ExtraBold
- Iosevka NFP ExtraBold Obl
- Iosevka NFP ExtraLight
- Iosevka NFP ExtraLight Obl
- Iosevka NFP Heavy
- Iosevka NFP Heavy Obl
- Iosevka NFP Light
- Iosevka NFP Light Obl
- Iosevka NFP Medium
- Iosevka NFP Medium Obl
- Iosevka NFP Obl
- Iosevka NFP SemiBold
- Iosevka NFP SemiBold Obl
- Iosevka NFP Thin
- Iosevka NFP Thin Obl
- IosevkaTerm NF
- IosevkaTerm NF ExtraBold
- IosevkaTerm NF ExtraBold Obl
- IosevkaTerm NF ExtraLight
- IosevkaTerm NF ExtraLight Obl
- IosevkaTerm NF Heavy
- IosevkaTerm NF Heavy Obl
- IosevkaTerm NF Light
- IosevkaTerm NF Light Obl
- IosevkaTerm NF Medium
- IosevkaTerm NF Medium Obl
- IosevkaTerm NF Obl
- IosevkaTerm NF SemiBold
- IosevkaTerm NF SemiBold Obl
- IosevkaTerm NF Thin
- IosevkaTerm NF Thin Obl
- IosevkaTerm NFM
- IosevkaTerm NFM ExtraBold
- IosevkaTerm NFM ExtraBold Obl
- IosevkaTerm NFM ExtraLight
- IosevkaTerm NFM ExtraLight Obl
- IosevkaTerm NFM Heavy
- IosevkaTerm NFM Heavy Obl
- IosevkaTerm NFM Light
- IosevkaTerm NFM Light Obl
- IosevkaTerm NFM Medium
- IosevkaTerm NFM Medium Obl
- IosevkaTerm NFM Obl
- IosevkaTerm NFM SemiBold
- IosevkaTerm NFM SemiBold Obl
- IosevkaTerm NFM Thin
- IosevkaTerm NFM Thin Obl
- IosevkaTerm NFP
- IosevkaTerm NFP ExtraBold
- IosevkaTerm NFP ExtraBold Obl
- IosevkaTerm NFP ExtraLight
- IosevkaTerm NFP ExtraLight Obl
- IosevkaTerm NFP Heavy
- IosevkaTerm NFP Heavy Obl
- IosevkaTerm NFP Light
- IosevkaTerm NFP Light Obl
- IosevkaTerm NFP Medium
- IosevkaTerm NFP Medium Obl
- IosevkaTerm NFP Obl
- IosevkaTerm NFP SemiBold
- IosevkaTerm NFP SemiBold Obl
- IosevkaTerm NFP Thin
- IosevkaTerm NFP Thin Obl
- IosevkaTermSlab NF
- IosevkaTermSlab NF ExtraBold
- IosevkaTermSlab NF ExtraBold Ob
- IosevkaTermSlab NF Light
- IosevkaTermSlab NF Light Obl
- IosevkaTermSlab NF Medium
- IosevkaTermSlab NF Medium Obl
- IosevkaTermSlab NF Obl
- IosevkaTermSlab NFM
- IosevkaTermSlab NFM ExtraBold
- IosevkaTermSlab NFM ExtraBold O
- IosevkaTermSlab NFM Light
- IosevkaTermSlab NFM Light Obl
- IosevkaTermSlab NFM Medium
- IosevkaTermSlab NFM Medium Obl
- IosevkaTermSlab NFM Obl
- IosevkaTermSlab NFP
- IosevkaTermSlab NFP ExtraBold
- IosevkaTermSlab NFP ExtraBold O
- IosevkaTermSlab NFP Light
- IosevkaTermSlab NFP Light Obl
- IosevkaTermSlab NFP Medium
- IosevkaTermSlab NFP Medium Obl
- IosevkaTermSlab NFP Obl
- Javanese Text
- Leelawadee UI
- Leelawadee UI Semilight
- Lucida Console
- Lucida Sans Unicode
- MS Sans Serif
- MS Serif
- MS UI Gothic
- MV Boli
- Malgun Gothic
- Malgun Gothic Semilight
- Marlett
- Material Icons
- Meiryo UI
- Microsoft Himalaya
- Microsoft JhengHei
- Microsoft JhengHei Light
- Microsoft JhengHei UI
- Microsoft JhengHei UI Light
- Microsoft New Tai Lue
- Microsoft PhagsPa
- Microsoft Sans Serif
- Microsoft Tai Le
- Microsoft YaHei
- Microsoft YaHei Light
- Microsoft YaHei UI
- Microsoft YaHei UI Light
- Microsoft Yi Baiti
- MingLiU-ExtB
- MingLiU_HKSCS-ExtB
- Modern
- Mongolian Baiti
- Myanmar Text
- NSimSun
- Nirmala UI
- Nirmala UI Semilight
- Noto Sans CJK HK
- Noto Sans CJK HK Black
- Noto Sans CJK HK DemiLight
- Noto Sans CJK HK Light
- Noto Sans CJK HK Medium
- Noto Sans CJK HK Thin
- Noto Sans CJK JP
- Noto Sans CJK JP Black
- Noto Sans CJK JP DemiLight
- Noto Sans CJK JP Light
- Noto Sans CJK JP Medium
- Noto Sans CJK JP Thin
- Noto Sans CJK KR
- Noto Sans CJK KR Black
- Noto Sans CJK KR DemiLight
- Noto Sans CJK KR Light
- Noto Sans CJK KR Medium
- Noto Sans CJK KR Thin
- Noto Sans CJK SC
- Noto Sans CJK SC Black
- Noto Sans CJK SC DemiLight
- Noto Sans CJK SC Light
- Noto Sans CJK SC Medium
- Noto Sans CJK SC Thin
- Noto Sans CJK TC
- Noto Sans CJK TC Black
- Noto Sans CJK TC DemiLight
- Noto Sans CJK TC Light
- Noto Sans CJK TC Medium
- Noto Sans CJK TC Thin
- Noto Sans Mono CJK HK
- Noto Sans Mono CJK JP
- Noto Sans Mono CJK KR
- Noto Sans Mono CJK SC
- Noto Sans Mono CJK TC
- Noto Serif CJK JP
- Noto Serif CJK JP Black
- Noto Serif CJK JP ExtraLight
- Noto Serif CJK JP Light
- Noto Serif CJK JP Medium
- Noto Serif CJK JP SemiBold
- Noto Serif CJK KR
- Noto Serif CJK KR Black
- Noto Serif CJK KR ExtraLight
- Noto Serif CJK KR Light
- Noto Serif CJK KR Medium
- Noto Serif CJK KR SemiBold
- Noto Serif CJK SC
- Noto Serif CJK SC Black
- Noto Serif CJK SC ExtraLight
- Noto Serif CJK SC Light
- Noto Serif CJK SC Medium
- Noto Serif CJK SC SemiBold
- Noto Serif CJK TC
- Noto Serif CJK TC Black
- Noto Serif CJK TC ExtraLight
- Noto Serif CJK TC Light
- Noto Serif CJK TC Medium
- Noto Serif CJK TC SemiBold
- PMingLiU-ExtB
- Palatino Linotype
- Roman
- Sans Serif Collection
- Script
- Segoe Fluent Icons
- Segoe MDL2 Assets
- Segoe Print
- Segoe Script
- Segoe UI
- Segoe UI Black
- Segoe UI Emoji
- Segoe UI Historic
- Segoe UI Light
- Segoe UI Semibold
- Segoe UI Semilight
- Segoe UI Symbol
- Segoe UI Variable Display
- Segoe UI Variable Display Light
- Segoe UI Variable Display Semib
- Segoe UI Variable Display Semil
- Segoe UI Variable Small
- Segoe UI Variable Small Light
- Segoe UI Variable Small Semibol
- Segoe UI Variable Small Semilig
- Segoe UI Variable Text
- Segoe UI Variable Text Light
- Segoe UI Variable Text Semibold
- Segoe UI Variable Text Semiligh
- SimSun
- SimSun-ExtB
- SimSun-ExtG
- Sitka Banner
- Sitka Banner Semibold
- Sitka Display
- Sitka Display Semibold
- Sitka Heading
- Sitka Heading Semibold
- Sitka Small
- Sitka Small Semibold
- Sitka Subheading
- Sitka Subheading Semibold
- Sitka Text
- Sitka Text Semibold
- Small Fonts
- Sylfaen
- Symbol
- Symbols Nerd Font Mono
- System
- Tahoma
- Terminal
- Times New Roman
- Trebuchet MS
- UD デジタル 教科書体 N-B
- UD デジタル 教科書体 N-R
- UD デジタル 教科書体 NK-B
- UD デジタル 教科書体 NK-R
- UD デジタル 教科書体 NP-B
- UD デジタル 教科書体 NP-R
- Verdana
- Weather Icons
- Webdings
- Wingdings
- Yu Gothic UI
- Yu Gothic UI Light
- Yu Gothic UI Semibold
- Yu Gothic UI Semilight
- all-the-icons
- file-icons
- github-octicons
- メイリオ
- 游ゴシック
- 游ゴシック Light
- 游ゴシック Medium
- 游明朝
- 游明朝 Demibold
- 游明朝 Light
- ＭＳ ゴシック
- ＭＳ 明朝
- ＭＳ Ｐゴシック
- ＭＳ Ｐ明朝

*** RESULTS(LINUX):
- Abyssinica SIL
- Ani
- AnjaliOldLipi
- Bitstream Charter
- C059
- Cantarell
- Century Schoolbook L
- Chandas
- Chilanka
- Courier
- Courier 10 Pitch
- D050000L
- DejaVu Sans
- DejaVu Sans Mono
- DejaVu Serif
- Dhurjati
- Dingbats
- Droid Sans Fallback
- Dyuthi
- Fira Code
- FontAwesome
- FreeMono
- FreeSans
- FreeSerif
- Gargi
- Garuda
- Gayathri
- Gidugu
- Gubbi
- Gurajada
- Iosevka
- Jamrul
- KacstArt
- KacstBook
- KacstDecorative
- KacstDigital
- KacstFarsi
- KacstLetter
- KacstNaskh
- KacstOffice
- KacstOne
- KacstPen
- KacstPoster
- KacstQurn
- KacstScreen
- KacstTitle
- KacstTitleL
- Kalapi
- Kalimati
- Karumbi
- Keraleeyam
- Khmer OS
- Khmer OS System
- Kinnari
- LKLUG
- LakkiReddy
- Laksaman
- Latin Modern Math
- Latin Modern Mono
- Latin Modern Mono Caps
- Latin Modern Mono Light
- Latin Modern Mono Light Cond
- Latin Modern Mono Prop
- Latin Modern Mono Prop Light
- Latin Modern Mono Slanted
- Latin Modern Roman
- Latin Modern Roman Caps
- Latin Modern Roman Demi
- Latin Modern Roman Dunhill
- Latin Modern Roman Slanted
- Latin Modern Roman Unslanted
- Latin Modern Sans
- Latin Modern Sans Demi Cond
- Latin Modern Sans Quotation
- Lato
- Liberation Mono
- Liberation Sans
- Liberation Sans Narrow
- Liberation Serif
- Likhan
- Lohit Assamese
- Lohit Bengali
- Lohit Devanagari
- Lohit Gujarati
- Lohit Gurmukhi
- Lohit Kannada
- Lohit Malayalam
- Lohit Odia
- Lohit Tamil
- Lohit Tamil Classical
- Lohit Telugu
- Loma
- Mallanna
- Mandali
- Manjari
- Material Icons
- Meera
- Mitra
- Mukti
- NATS
- NTR
- Nakula
- Navilu
- Nimbus Mono L
- Nimbus Mono PS
- Nimbus Roman
- Nimbus Roman No9 L
- Nimbus Sans
- Nimbus Sans L
- Nimbus Sans Narrow
- Norasi
- Noto Color Emoji
- Noto Mono
- Noto Sans CJK HK
- Noto Sans CJK JP
- Noto Sans CJK KR
- Noto Sans CJK SC
- Noto Sans CJK TC
- Noto Sans Mono
- Noto Sans Mono CJK HK
- Noto Sans Mono CJK JP
- Noto Sans Mono CJK KR
- Noto Sans Mono CJK SC
- Noto Sans Mono CJK TC
- Noto Serif CJK HK
- Noto Serif CJK JP
- Noto Serif CJK KR
- Noto Serif CJK SC
- Noto Serif CJK TC
- OpenSymbol
- P052
- Padauk
- Padauk Book
- Pagul
- Peddana
- Phetsarath OT
- Ponnala
- Pothana2000
- Potti Sreeramulu
- Purisa
- Rachana
- RaghuMalayalamSans
- Ramabhadra
- Ramaraja
- Rasa
- RaviPrakash
- Rekha
- Saab
- Sahadeva
- Samanata
- Samyak Devanagari
- Samyak Gujarati
- Samyak Malayalam
- Samyak Tamil
- Sarai
- Sawasdee
- Sree Krushnadevaraya
- Standard Symbols L
- Standard Symbols PS
- Suranna
- Suravaram
- Suruma
- Syamala Ramana
- Symbols Nerd Font Mono
- TeX Gyre Adventor
- TeX Gyre Bonum
- TeX Gyre Bonum Math
- TeX Gyre Chorus
- TeX Gyre Cursor
- TeX Gyre DejaVu Math
- TeX Gyre Heros
- TeX Gyre Heros Cn
- TeX Gyre Pagella
- TeX Gyre Pagella Math
- TeX Gyre Schola
- TeX Gyre Schola Math
- TeX Gyre Termes
- TeX Gyre Termes Math
- TenaliRamakrishna
- Tibetan Machine Uni
- Timmana
- Tlwg Mono
- Tlwg Typewriter
- Tlwg Typist
- Tlwg Typo
- URW Bookman
- URW Bookman L
- URW Chancery L
- URW Gothic
- URW Gothic L
- URW Palladio L
- Ubuntu
- Ubuntu Condensed
- Ubuntu Mono
- Umpush
- Uroob
- Utopia
- Vemana2000
- Waree
- Weather Icons
- Yrsa
- Z003
- aakar
- all-the-icons
- bitstream charter
- clean
- clearlyu
- clearlyu alternate glyphs
- clearlyu arabic
- clearlyu arabic extra
- clearlyu devanagari
- clearlyu devangari extra
- clearlyu ligature
- clearlyu pua
- courier 10 pitch
- fangsong ti
- file-icons
- fixed
- github-octicons
- gothic
- latin modern roman
- latin modern sans
- latin modern sansquotation
- latin modern typewriter
- latin modern typewriter variable width
- mincho
- mry_KacstQurn
- newspaper
- nil
- open look cursor
- open look glyph
- ori1Uni
- padmaa
- padmaa-Bold.1.1
- song ti
- texgyreadventor
- texgyrebonum
- texgyrechorus
- texgyrecursor
- texgyreheros
- texgyrepagella
- texgyreschola
- texgyretermes

** 日本語の範囲をNotoフォントに設定
#+begin_src elisp :tangle yes
  ;; 日本語の範囲をNotoフォントに設定
  (when (display-graphic-p)
    (set-fontset-font nil 'japanese-jisx0208 (font-spec :family "Noto Serif CJK JP"))
    ;; (set-fontset-font nil 'japanese-jisx0208 (font-spec :family "Noto Sans CJK JP"))
    )
  #+end_src

** 確認用テーブル
|----------------------------------+------------------------|
| this is a header 1               | this is a header2      |
|----------------------------------+------------------------|
| これはヘッダー位置ですよーん漢字 | 揃っているみたいですね |
| カタカナ                         | カタカナ崩れませんか   |
|----------------------------------+------------------------|

** Notoフォントのインストール
*** Windows
#+begin_src bash
  kenjiro@um560-win11 MINGW64 ~
  $ scoop bucket add nerd-fonts
  Checking repo... OK
  The nerd-fonts bucket was added successfully.

  kenjiro@um560-win11 MINGW64 ~
  $ scoop search noto
  Results from local buckets...

  Name                          Version  Source     Binaries
  ----                          -------  ------     --------
  Noto-CJK-Mega-OTC             20190603 nerd-fonts
  Noto-NF-Mono                  3.2.1    nerd-fonts
  Noto-NF-Propo                 3.2.1    nerd-fonts
  Noto-NF                       3.2.1    nerd-fonts
  Source-Han-Noto-CJK-Ultra-OTC 20190603 nerd-fonts


  kenjiro@um560-win11 MINGW64 ~
  $ scoop install Noto-CJK-Mega-OTC
  Updating Scoop...
  Updating Buckets...
  Scoop was updated successfully!
  Installing 'Noto-CJK-Mega-OTC' (20190603) [64bit] from 'nerd-fonts' bucket
  NotoCJK.ttc (272.5 MB) [======================================================================================] 100%
  Checking hash of NotoCJK.ttc ... ok.
  Running installer script...done.
  Linking ~\scoop\apps\Noto-CJK-Mega-OTC\current => ~\scoop\apps\Noto-CJK-Mega-OTC\20190603
  'Noto-CJK-Mega-OTC' (20190603) was installed successfully!

  kenjiro@um560-win11 MINGW64 ~
#+end_src

** Iosevkaフォントのインストール
https://github.com/be5invis/Iosevka
