experimental-init.el

;; https://systemcrafters.net/emacs-shorts/pomodoro-timer/
(setq org-clock-sound "/usr/share/sounds/sound-icons/xylofon.wav")
;; C-c C-x ;
(org-timer-set-timer 25)

;; キーストローク表示
;; https://github.com/tarsius/keycast
(use-package keycast
  :ensure t)

;; 日本語の範囲をNotoフォントに設定
(when (display-graphic-p)
  (set-fontset-font nil 'japanese-jisx0208 (font-spec :family "Noto Serif CJK JP"))
  ;; (set-fontset-font nil 'japanese-jisx0208 (font-spec :family "Noto Sans CJK JP"))
  )

(use-package eglot
  :ensure t
  :hook
