experimental-init.org
*** Linux
#+begin_src bash
  mkdir -p ~/Downloads
  cd ~/Downloads
  curl -O https://sid.ethz.ch/debian/fonts-iosevka/fonts-iosevka_22.0.0%2Bds-1_all.deb
  sudo dpkg -i fonts-iosevka_22.0.0%2Bds-1_all.deb
#+end_src

#+RESULTS:

*** Windows
#+begin_src bash
  kenjiro@um560-win11 MINGW64 ~
  $ scoop search iosevka
  Results from local buckets...

  Name                     Version Source     Binaries
  ----                     ------- ------     --------
  Iosevka-NF-Mono          3.2.1   nerd-fonts
  Iosevka-NF-Propo         3.2.1   nerd-fonts
  Iosevka-NF               3.2.1   nerd-fonts
  IosevkaTerm-NF-Mono      3.2.1   nerd-fonts
  IosevkaTerm-NF-Propo     3.2.1   nerd-fonts
  IosevkaTerm-NF           3.2.1   nerd-fonts
  IosevkaTermSlab-NF-Mono  3.2.1   nerd-fonts
  IosevkaTermSlab-NF-Propo 3.2.1   nerd-fonts
  IosevkaTermSlab-NF       3.2.1   nerd-fonts


  kenjiro@um560-win11 MINGW64 ~
  $ scoop install Iosevka-NF-Mono Iosevka-NF-Propo Iosevka-NF IosevkaTerm-NF-Mono IosevkaTerm-NF-Propo IosevkaTerm-NF IosevkaTermSlab-NF-Mono IosevkaTermSlab-NF-Propo IosevkaTermSlab-NF
  Installing 'Iosevka-NF-Mono' (3.2.1) [64bit] from 'nerd-fonts' bucket
  Iosevka.zip (324.0 MB) [======================================================================================] 100%
  Checking hash of Iosevka.zip ... ok.
  Extracting Iosevka.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\Iosevka-NF-Mono\current => ~\scoop\apps\Iosevka-NF-Mono\3.2.1
  'Iosevka-NF-Mono' (3.2.1) was installed successfully!
  Installing 'Iosevka-NF-Propo' (3.2.1) [64bit] from 'nerd-fonts' bucket
  Iosevka.zip (324.0 MB) [======================================================================================] 100%
  Checking hash of Iosevka.zip ... ok.
  Extracting Iosevka.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\Iosevka-NF-Propo\current => ~\scoop\apps\Iosevka-NF-Propo\3.2.1
  'Iosevka-NF-Propo' (3.2.1) was installed successfully!
  Installing 'Iosevka-NF' (3.2.1) [64bit] from 'nerd-fonts' bucket
  Iosevka.zip (324.0 MB) [======================================================================================] 100%
  Checking hash of Iosevka.zip ... ok.
  Extracting Iosevka.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\Iosevka-NF\current => ~\scoop\apps\Iosevka-NF\3.2.1
  'Iosevka-NF' (3.2.1) was installed successfully!
  Installing 'IosevkaTerm-NF-Mono' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTerm.zip (324.1 MB) [==================================================================================] 100%
  Checking hash of IosevkaTerm.zip ... ok.
  Extracting IosevkaTerm.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTerm-NF-Mono\current => ~\scoop\apps\IosevkaTerm-NF-Mono\3.2.1
  'IosevkaTerm-NF-Mono' (3.2.1) was installed successfully!
  Installing 'IosevkaTerm-NF-Propo' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTerm.zip (324.1 MB) [==================================================================================] 100%
  Checking hash of IosevkaTerm.zip ... ok.
  Extracting IosevkaTerm.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTerm-NF-Propo\current => ~\scoop\apps\IosevkaTerm-NF-Propo\3.2.1
  'IosevkaTerm-NF-Propo' (3.2.1) was installed successfully!
  Installing 'IosevkaTerm-NF' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTerm.zip (324.1 MB) [==================================================================================] 100%
  Checking hash of IosevkaTerm.zip ... ok.
  Extracting IosevkaTerm.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTerm-NF\current => ~\scoop\apps\IosevkaTerm-NF\3.2.1
  'IosevkaTerm-NF' (3.2.1) was installed successfully!
  Installing 'IosevkaTermSlab-NF-Mono' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTermSlab.zip (182.4 MB) [==============================================================================] 100%
  Checking hash of IosevkaTermSlab.zip ... ok.
  Extracting IosevkaTermSlab.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTermSlab-NF-Mono\current => ~\scoop\apps\IosevkaTermSlab-NF-Mono\3.2.1
  'IosevkaTermSlab-NF-Mono' (3.2.1) was installed successfully!
  Installing 'IosevkaTermSlab-NF-Propo' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTermSlab.zip (182.4 MB) [==============================================================================] 100%
  Checking hash of IosevkaTermSlab.zip ... ok.
  Extracting IosevkaTermSlab.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTermSlab-NF-Propo\current => ~\scoop\apps\IosevkaTermSlab-NF-Propo\3.2.1
  'IosevkaTermSlab-NF-Propo' (3.2.1) was installed successfully!
  Installing 'IosevkaTermSlab-NF' (3.2.1) [64bit] from 'nerd-fonts' bucket
  IosevkaTermSlab.zip (182.4 MB) [==============================================================================] 100%
  Checking hash of IosevkaTermSlab.zip ... ok.
  Extracting IosevkaTermSlab.zip ... done.
  Running installer script...done.
  Linking ~\scoop\apps\IosevkaTermSlab-NF\current => ~\scoop\apps\IosevkaTermSlab-NF\3.2.1
  'IosevkaTermSlab-NF' (3.2.1) was installed successfully!
#+end_src

* ewwのフォントが汚い件
#+begin_src
M-x eww-toggle-fonts
または
F => Shift-f
#+end_src

* Eglot導入
lspサーバーとの比較のため導入してみる
#+begin_src elisp :tangle yes
  (use-package eglot
    :ensure t
    :hook
    (c-mode . eglot-ensure)
    (c++-mode . eglot-ensure)
    (objc-mode . eglot-ensure)
    :config
    (add-to-list 'eglot-server-programs '((c-mode c++-mode objc-mode) "clangd")))
#+end_src
* Tree sitter
#+begin_src elisp :tangle yes
  ;; 構文解析エンジン Tree sitter
  (unless (version< emacs-version "29.0")
    (use-package treesit-auto
      :ensure t
      :config
      (setq treesit-auto-install t)
      (global-treesit-auto-mode)))
#+end_src
* フレームの回転
#+begin_src elisp :tangle yes
  ;; フレームの回転
  (use-package transpose-frame
    :ensure t)
#+end_src
* ウィンドウのリサイズ
#+begin_src elisp :tangle yes
  ;; C-s <araow keys> でウィンドウのサイズをマウスを使わずに調節する
  ;;
  ;; Window Resize
  ;; https://www.emacswiki.org/emacs/WindowResize
  ;;
  (defun win-resize-top-or-bot ()
    "Figure out if the current window is on top, bottom or in the
  middle"
    (let* ((win-edges (window-edges))
           (this-window-y-min (nth 1 win-edges))
           (this-window-y-max (nth 3 win-edges))
           (fr-height (frame-height)))
      (cond
       ((eq 0 this-window-y-min) "top")
       ((eq (- fr-height 1) this-window-y-max) "bot")
       (t "mid"))))

  (defun win-resize-left-or-right ()
    "Figure out if the current window is to the left, right or in the
  middle"
    (let* ((win-edges (window-edges))
           (this-window-x-min (nth 0 win-edges))
           (this-window-x-max (nth 2 win-edges))
           (fr-width (frame-width)))
      (cond
       ((eq 0 this-window-x-min) "left")
       ((eq (+ fr-width 4) this-window-x-max) "right")
       (t "mid"))))

  (defun win-resize-enlarge-horiz ()
    (interactive)
    (cond
     ((equal "top" (win-resize-top-or-bot)) (enlarge-window -1))
     ((equal "bot" (win-resize-top-or-bot)) (enlarge-window 1))
     ((equal "mid" (win-resize-top-or-bot)) (enlarge-window -1))
     (t (message "nil"))))

  (defun win-resize-minimize-horiz ()
    (interactive)
    (cond
     ((equal "top" (win-resize-top-or-bot)) (enlarge-window 1))
     ((equal "bot" (win-resize-top-or-bot)) (enlarge-window -1))
     ((equal "mid" (win-resize-top-or-bot)) (enlarge-window 1))
     (t (message "nil"))))

  (defun win-resize-enlarge-vert ()
    (interactive)
    (cond
     ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally -1))
     ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally 1))
     ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally -1))))

  (defun win-resize-minimize-vert ()
    (interactive)
    (cond
     ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally 1))
     ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally -1))
     ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally 1))))

  ;; replace all C-M-(down|up|left|right) to
  ;;             C-s-(down|up|left|right)
  ;; reason for confilict to paredit
  (global-set-key [C-s-down] 'win-resize-minimize-vert)
  (global-set-key [C-s-up] 'win-resize-enlarge-vert)
  (global-set-key [C-s-left] 'win-resize-minimize-horiz)
  (global-set-key [C-s-right] 'win-resize-enlarge-horiz)
  (global-set-key [C-s-up] 'win-resize-enlarge-horiz)
  (global-set-key [C-s-down] 'win-resize-minimize-horiz)
  (global-set-key [C-s-left] 'win-resize-enlarge-vert)
  (global-set-key [C-s-right] 'win-resize-minimize-vert)
#+end_src
* sudo編集
#+begin_src elisp :tangle yes
  (use-package sudo-edit
    :ensure t
    :pin melpa)
#+end_src
* Which Key
 [[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.
#+begin_src emacs-lisp :tangle yes
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src
* アイコン装飾
#+begin_src elisp :tangle yes
  (use-package all-the-icons
    :if (display-graphic-p))

  (when (display-graphic-p)
    (use-package nerd-icons)
    (unless (kf:font-family-installed-p "all-the-icons")
      (all-the-icons-install-fonts))
    (unless (kf:font-family-installed-p "symbols nerd")
      (nerd-icons-install-fonts)))

  (use-package all-the-icons-dired
    :if (display-graphic-p)
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
* astyle
#+begin_src elisp :tangle yes
  (use-package astyle
    :ensure t
    :when (executable-find "astyle"))
#+end_src
* CMake 対応
#+begin_src elisp :tangle yes
  (use-package cmake-mode
    :ensure t)
  (setq auto-mode-alist
        (append
         '(("CMakeLists\\.txt\\'" . cmake-mode))
         '(("\\.cmake\\'" . cmake-mode))
         auto-mode-alist))
#+end_src
* 末尾のゴミを可視化
#+begin_src elisp :tangle yes
  ;; https://qiita.com/tadsan/items/df73c711f921708facdc
  (setq-default show-trailing-whitespace t)
  (defun my/disable-trailing-mode-hook ()
    "Disable show tail whitespace."
    (setq show-trailing-whitespace nil))

  (defvar my/disable-trailing-modes
    '(comint-mode
      eshell-mode
      eww-mode
      term-mode
      vterm-mode
      twittering-mode))

  (mapc
   (lambda (mode)
     (add-hook (intern (concat (symbol-name mode) "-hook"))
               'my/disable-trailing-mode-hook))
   my/disable-trailing-modes)
#+end_src
* モードラインをシンプル化
#+begin_src elisp :tangle yes
  (use-package doom-modeline
    :if (and (display-graphic-p) (not (eq system-type 'haiku)))
    :init
    (doom-modeline-mode +1))
#+end_src
