experimental-init.el
  (c-mode . eglot-ensure)
  (c++-mode . eglot-ensure)
  (objc-mode . eglot-ensure)
  :config
  (add-to-list 'eglot-server-programs '((c-mode c++-mode objc-mode) "clangd")))

;; 構文解析エンジン Tree sitter
(unless (version< emacs-version "29.0")
  (use-package treesit-auto
    :ensure t
    :config
    (setq treesit-auto-install t)
    (global-treesit-auto-mode)))

;; フレームの回転
(use-package transpose-frame
  :ensure t)

;; C-s <araow keys> でウィンドウのサイズをマウスを使わずに調節する
;;
;; Window Resize
;; https://www.emacswiki.org/emacs/WindowResize
;;
(defun win-resize-top-or-bot ()
  "Figure out if the current window is on top, bottom or in the
middle"
  (let* ((win-edges (window-edges))
         (this-window-y-min (nth 1 win-edges))
         (this-window-y-max (nth 3 win-edges))
         (fr-height (frame-height)))
    (cond
     ((eq 0 this-window-y-min) "top")
     ((eq (- fr-height 1) this-window-y-max) "bot")
     (t "mid"))))

(defun win-resize-left-or-right ()
  "Figure out if the current window is to the left, right or in the
middle"
  (let* ((win-edges (window-edges))
         (this-window-x-min (nth 0 win-edges))
         (this-window-x-max (nth 2 win-edges))
         (fr-width (frame-width)))
    (cond
     ((eq 0 this-window-x-min) "left")
     ((eq (+ fr-width 4) this-window-x-max) "right")
     (t "mid"))))

(defun win-resize-enlarge-horiz ()
  (interactive)
  (cond
   ((equal "top" (win-resize-top-or-bot)) (enlarge-window -1))
   ((equal "bot" (win-resize-top-or-bot)) (enlarge-window 1))
   ((equal "mid" (win-resize-top-or-bot)) (enlarge-window -1))
   (t (message "nil"))))

(defun win-resize-minimize-horiz ()
  (interactive)
  (cond
   ((equal "top" (win-resize-top-or-bot)) (enlarge-window 1))
   ((equal "bot" (win-resize-top-or-bot)) (enlarge-window -1))
   ((equal "mid" (win-resize-top-or-bot)) (enlarge-window 1))
   (t (message "nil"))))

(defun win-resize-enlarge-vert ()
  (interactive)
  (cond
   ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally -1))
   ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally 1))
   ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally -1))))

(defun win-resize-minimize-vert ()
  (interactive)
  (cond
   ((equal "left" (win-resize-left-or-right)) (enlarge-window-horizontally 1))
   ((equal "right" (win-resize-left-or-right)) (enlarge-window-horizontally -1))
   ((equal "mid" (win-resize-left-or-right)) (enlarge-window-horizontally 1))))

;; replace all C-M-(down|up|left|right) to
;;             C-s-(down|up|left|right)
;; reason for confilict to paredit
(global-set-key [C-s-down] 'win-resize-minimize-vert)
(global-set-key [C-s-up] 'win-resize-enlarge-vert)
(global-set-key [C-s-left] 'win-resize-minimize-horiz)
(global-set-key [C-s-right] 'win-resize-enlarge-horiz)
(global-set-key [C-s-up] 'win-resize-enlarge-horiz)
(global-set-key [C-s-down] 'win-resize-minimize-horiz)
(global-set-key [C-s-left] 'win-resize-enlarge-vert)
(global-set-key [C-s-right] 'win-resize-minimize-vert)

(use-package sudo-edit
  :ensure t
  :pin melpa)

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package all-the-icons
  :if (display-graphic-p))

(when (display-graphic-p)
  (use-package nerd-icons)
  (unless (kf:font-family-installed-p "all-the-icons")
    (all-the-icons-install-fonts))
  (unless (kf:font-family-installed-p "symbols nerd")
    (nerd-icons-install-fonts)))

(use-package all-the-icons-dired
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package astyle
  :ensure t
  :when (executable-find "astyle"))

(use-package cmake-mode
  :ensure t)
(setq auto-mode-alist
      (append
       '(("CMakeLists\\.txt\\'" . cmake-mode))
       '(("\\.cmake\\'" . cmake-mode))
       auto-mode-alist))

;; https://qiita.com/tadsan/items/df73c711f921708facdc
(setq-default show-trailing-whitespace t)
(defun my/disable-trailing-mode-hook ()
  "Disable show tail whitespace."
  (setq show-trailing-whitespace nil))

(defvar my/disable-trailing-modes
  '(comint-mode
    eshell-mode
    eww-mode
    term-mode
    vterm-mode
    twittering-mode))

(mapc
 (lambda (mode)
   (add-hook (intern (concat (symbol-name mode) "-hook"))
             'my/disable-trailing-mode-hook))
 my/disable-trailing-modes)

(use-package doom-modeline
  :if (and (display-graphic-p) (not (eq system-type 'haiku)))
  :init
  (doom-modeline-mode +1))
