experimental-init.el

;; TODO この対策は一時的なものであるため、通常のoptionsに戻すのを忘れないこと
(when (and (display-graphic-p) (kf:font-family-installed-p "iosevka"))
  (let ((font-height (if (< (display-pixel-height) 900) 100 130))
        (custom-set-faces
         ;; custom-set-faces was added by Custom.
         ;; If you edit it by hand, you could mess it up, so be careful.
         ;; Your init file should contain only one such instance.
         ;; If there is more than one, they won't work right.
         ;;
         '(default ((t (:family "Iosevka" :foundry "UKWN" :slant normal :weight regular :height font-height :width normal))))
         ))))

;; デスクトップ環境の保存
;; https://www.gnu.org/software/emacs//manual/html_node/emacs/Saving-Emacs-Sessions.html
(desktop-save-mode (if (display-graphic-p) +1 -1))
;; ホスト名を付加してファイル名衝突回避
(setq desktop-base-file-name (concat "." (safe-host-name-string) "-emacs.desktop"))

(use-package ef-themes
  :ensure t
  :config
  (ef-themes-select 'ef-cyprus))

;; https://agel.readthedocs.io/en/latest/index.html
(use-package ag
  :ensure t)

(use-package projectile
  :config
  (defun projectile-project-find-function (dir)
    (let* ((root (projectile-project-root dir)))
      (and root (cons 'transient root))))
  (with-eval-after-load 'project
    (add-to-list 'project-find-functions 'projectile-project-find-function))
  )

;; (use-package eglot
;;   :bind (:map eglot-mode-map
;;               ("C-c C-d" . eglot-help-at-point)
;;               ("C-c C-r" . eglot-code-actions))
;;   :hook
;;   ((c-mode-common . eglot-ensure))
;;   )

(defun kf:c-mode-init ()
  (c-toggle-auto-newline 1)
  (setq c-hanging-braces-alist '((statement-open before after)
                                 (substatement-open before after) ))
  )
(defun kf:objc-mode-init ()
  (c-toggle-auto-newline 1)
  (setq c-hanging-braces-alist '((statement before after)
                                 (statement-open before after)
                                 (substatement-open before after) ))
  )
(add-hook 'c-mode-hook 'kf:c-mode-init)
(add-hook 'objc-mode-hook 'kf:objc-mode-init)

;; https://qiita.com/fujimisakari/items/a6ff082f0e8eddc09511
;; .hファイルもobjc-modeで開くけるようにする
(add-to-list 'magic-mode-alist
             `(,(lambda ()
                  (and (string= (file-name-extension buffer-file-name) "h")
                       (re-search-forward "@\\<interface\\>"
                                          magic-mode-regexp-match-limit t)))
               . objc-mode))

(use-package clang-format
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.gsmarkup$" . xml-mode))

;; NeoTree
;; https://tsuu32.hatenablog.com/entry/2020/08/19/004306
(use-package neotree
  :ensure t
  :config
  (setq neo-show-hidden-files t) ; dot-fileも表示する
  (setq neo-theme 'icons) )
