experimental-init.org
* Orderless
#+begin_src elisp :tangle yes
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src
* Mozc
#+begin_src elisp :tangle no
  ;; sudo apt install -y emacs-mozc emacs-mozc-bin
  ;; 現在、 cl deprecated で起動エラーが出るため、OFFにしておく
  (when (kf:ensure-load-file "/usr/share/emacs/site-lisp/emacs-mozc/mozc.el")
    (setq default-input-method "japanese-mozc"))

      #+end_src

#+RESULTS:

ジャパニーズもずく打てますかね？
入力の感触は良いが、インライン変換できるのは気持ちが良い。

* Haiku Support
** Setup Jamfile mode
#+begin_src elisp :tangle yes
  ;; Haiku build system
  (kf:ensure-load-file "~/.emacs.d/lisp/jam-mode.el")

#+end_src

** Haiku Format
* マルチプルカーソル
- [[https://emacsrocks.com/e13.html]]
- [[https://github.com/magnars/multiple-cursors.el]]
#+begin_src elisp :tangle yes
  (use-package multiple-cursors
    :ensure t)

  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->")         'mc/mark-next-like-this)
  (global-set-key (kbd "C-<")         'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<")     'mc/mark-all-like-this)
  (global-set-key (kbd "C-\"")        'mc/skip-to-next-like-this)
  (global-set-key (kbd "C-:")         'mc/skip-to-previous-like-this)
#+end_src

#+RESULTS:
* Transclude
#+begin_src elisp :tangle yes
  (use-package org-transclusion
    :ensure t
    :after org)
  (define-key global-map (kbd "C-c <f12>") #'org-transclusion-add)
  (define-key global-map (kbd "C-c t") #'org-transclusion-mode)
#+end_src
* 定型文の挿入
#+begin_src elisp :tangle yes
  (use-package yasnippet)
  (use-package yasnippet-snippets)
#+end_src
* Common Lisp環境
#+begin_src elisp :tangle yes
  ;; https://github.com/roswell/roswell
  (kf:ensure-load-file "~/.roswell/helper.el")

#+end_src
* Free Basic
#+begin_src elisp :tangle yes
  ;; https://github.com/rversteegen/fb-mode
  (kf:ensure-load-file "~/.emacs.d/lisp/fb-mode.el")

#+end_src


* 末尾
#+BEGIN_SRC elisp :tangle yes
  (recentf-open-files)
#+END_SRC
