experimental-init.el

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

;; Haiku build system
(kf:ensure-load-file "~/.emacs.d/lisp/jam-mode.el")

(use-package multiple-cursors
  :ensure t)

(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->")         'mc/mark-next-like-this)
(global-set-key (kbd "C-<")         'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<")     'mc/mark-all-like-this)
(global-set-key (kbd "C-\"")        'mc/skip-to-next-like-this)
(global-set-key (kbd "C-:")         'mc/skip-to-previous-like-this)

(use-package org-transclusion
  :ensure t
  :after org)
(define-key global-map (kbd "C-c <f12>") #'org-transclusion-add)
(define-key global-map (kbd "C-c t") #'org-transclusion-mode)

(use-package yasnippet)
(use-package yasnippet-snippets)

;; https://github.com/roswell/roswell
(kf:ensure-load-file "~/.roswell/helper.el")

;; https://github.com/rversteegen/fb-mode
(kf:ensure-load-file "~/.emacs.d/lisp/fb-mode.el")

(use-package d-mode
  :ensure t)

(recentf-open-files)
